students = [
    ["Иванов", "Иван", "Иванович", 1998, 2, "Группа 1", [4, 5, 3, 4, 5]],
    ["Петров", "Петр", "Петрович", 1999, 2, "Группа 2", [3, 4, 4, 5, 4]],
    ["Сидоров", "Алексей", "Алексеевич", 1997, 2, "Группа 1", [5, 5, 5, 4, 5]],
    ["Козлова", "Мария", "Ивановна", 2000, 1, "Группа 3", [4, 3, 4, 3, 5]],
    ["Васильев", "Андрей", "Васильевич", 1999, 1, "Группа 2", [5, 4, 5, 4, 5]]
]


def sorted_list_of_students():
    sorted_students = sorted(students, key=lambda x: (x[4], x[0]))
    return sorted_students


def average_mark_of_groups():


print("Отсортированный список:\n", sorted_list_of_students())
